      ***********************************************
      * Author: Tu Nombre
      * Date: 2026-09-08
      * Purpose: Aprender comentarios estructurados
      * Tectonics: cobc
      ***********************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY "HOLA MUNDO"
           STOP RUN.
       END PROGRAM HELLO-WORLD.