      ***********************************************
      * Author: Tu Nombre
      * Date: 2026-09-08
      * Purpose: Aprender comentarios estructurados
      * Tectonics: cobc
      ***********************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       PROCEDURE DIVISION.
           DISPLAY 'Hello, World!'.
           STOP RUN.